; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/blocksworld/domain.pddl
;;
(define (domain blocksworld)

(:requirements :strips)

(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=6, out_folder=training/easy, instance_id=21, seed=48

(define (problem blocksworld-21)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 - object)
 (:init 
    (arm-empty)
    (clear b1)
    (on b1 b4)
    (on b4 b6)
    (on b6 b2)
    (on b2 b3)
    (on b3 b5)
    (on-table b5))
 (:goal  (and 
    (clear b2)
    (on b2 b5)
    (on b5 b3)
    (on b3 b4)
    (on b4 b1)
    (on b1 b6)
    (on-table b6))))

; plan
1. (unstack b1 b4)
   deleted: (on b1 b4) (clear b1) (arm-empty)
   added: (holding b1) (clear b4)
   goals met: 0 of 7
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 7
3. (unstack b4 b6)
   deleted: (on b4 b6) (clear b4) (arm-empty)
   added: (holding b4) (clear b6)
   goals met: 0 of 7
4. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 7
5. (unstack b6 b2)
   deleted: (on b6 b2) (clear b6) (arm-empty)
   added: (holding b6) (clear b2)
   goals met: 1 of 7
6. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 7
7. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 2 of 7
8. (stack b1 b6)
   deleted: (clear b6) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b6)
   goals met: 3 of 7
9. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 3 of 7
10. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 4 of 7
11. (unstack b2 b3)
   deleted: (on b2 b3) (clear b2) (arm-empty)
   added: (holding b2) (clear b3)
   goals met: 3 of 7
12. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 4 of 7
13. (unstack b3 b5)
   deleted: (on b3 b5) (clear b3) (arm-empty)
   added: (holding b3) (clear b5)
   goals met: 4 of 7
14. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 5 of 7
15. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 5 of 7
16. (stack b5 b3)
   deleted: (clear b3) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b3)
   goals met: 6 of 7
17. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 5 of 7
18. (stack b2 b5)
   deleted: (clear b5) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b5)
   goals met: 7 of 7
